grevaillot/svd_tools/headers/ATSAM3X8H/piob.h
/** @defgroup piob_odsr ODSR Output Data Status Register
@{*/

/** PIOB_ODSR_P31 Output Data Status **/
#define PIOB_ODSR_P31		(1 << 31)
/** PIOB_ODSR_P30 Output Data Status **/
#define PIOB_ODSR_P30		(1 << 30)
/** PIOB_ODSR_P29 Output Data Status **/
#define PIOB_ODSR_P29		(1 << 29)
/** PIOB_ODSR_P28 Output Data Status **/
#define PIOB_ODSR_P28		(1 << 28)
/** PIOB_ODSR_P27 Output Data Status **/
#define PIOB_ODSR_P27		(1 << 27)
/** PIOB_ODSR_P26 Output Data Status **/
#define PIOB_ODSR_P26		(1 << 26)
/** PIOB_ODSR_P25 Output Data Status **/
#define PIOB_ODSR_P25		(1 << 25)
/** PIOB_ODSR_P24 Output Data Status **/
#define PIOB_ODSR_P24		(1 << 24)
/** PIOB_ODSR_P23 Output Data Status **/
#define PIOB_ODSR_P23		(1 << 23)
/** PIOB_ODSR_P22 Output Data Status **/
#define PIOB_ODSR_P22		(1 << 22)
/** PIOB_ODSR_P21 Output Data Status **/
#define PIOB_ODSR_P21		(1 << 21)
/** PIOB_ODSR_P20 Output Data Status **/
#define PIOB_ODSR_P20		(1 << 20)
/** PIOB_ODSR_P19 Output Data Status **/
#define PIOB_ODSR_P19		(1 << 19)
/** PIOB_ODSR_P18 Output Data Status **/
#define PIOB_ODSR_P18		(1 << 18)
/** PIOB_ODSR_P17 Output Data Status **/
#define PIOB_ODSR_P17		(1 << 17)
/** PIOB_ODSR_P16 Output Data Status **/
#define PIOB_ODSR_P16		(1 << 16)
/** PIOB_ODSR_P15 Output Data Status **/
#define PIOB_ODSR_P15		(1 << 15)
/** PIOB_ODSR_P14 Output Data Status **/
#define PIOB_ODSR_P14		(1 << 14)
/** PIOB_ODSR_P13 Output Data Status **/
#define PIOB_ODSR_P13		(1 << 13)
/** PIOB_ODSR_P12 Output Data Status **/
#define PIOB_ODSR_P12		(1 << 12)
/** PIOB_ODSR_P11 Output Data Status **/
#define PIOB_ODSR_P11		(1 << 11)
/** PIOB_ODSR_P10 Output Data Status **/
#define PIOB_ODSR_P10		(1 << 10)
/** PIOB_ODSR_P9 Output Data Status **/
#define PIOB_ODSR_P9		(1 << 9)
/** PIOB_ODSR_P8 Output Data Status **/
#define PIOB_ODSR_P8		(1 << 8)
/** PIOB_ODSR_P7 Output Data Status **/
#define PIOB_ODSR_P7		(1 << 7)
/** PIOB_ODSR_P6 Output Data Status **/
#define PIOB_ODSR_P6		(1 << 6)
/** PIOB_ODSR_P5 Output Data Status **/
#define PIOB_ODSR_P5		(1 << 5)
/** PIOB_ODSR_P4 Output Data Status **/
#define PIOB_ODSR_P4		(1 << 4)
/** PIOB_ODSR_P3 Output Data Status **/
#define PIOB_ODSR_P3		(1 << 3)
/** PIOB_ODSR_P2 Output Data Status **/
#define PIOB_ODSR_P2		(1 << 2)
/** PIOB_ODSR_P1 Output Data Status **/
#define PIOB_ODSR_P1		(1 << 1)
/** PIOB_ODSR_P0 Output Data Status **/
#define PIOB_ODSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pdsr PDSR Pin Data Status Register
@{*/

/** PIOB_PDSR_P31 Output Data Status **/
#define PIOB_PDSR_P31		(1 << 31)
/** PIOB_PDSR_P30 Output Data Status **/
#define PIOB_PDSR_P30		(1 << 30)
/** PIOB_PDSR_P29 Output Data Status **/
#define PIOB_PDSR_P29		(1 << 29)
/** PIOB_PDSR_P28 Output Data Status **/
#define PIOB_PDSR_P28		(1 << 28)
/** PIOB_PDSR_P27 Output Data Status **/
#define PIOB_PDSR_P27		(1 << 27)
/** PIOB_PDSR_P26 Output Data Status **/
#define PIOB_PDSR_P26		(1 << 26)
/** PIOB_PDSR_P25 Output Data Status **/
#define PIOB_PDSR_P25		(1 << 25)
/** PIOB_PDSR_P24 Output Data Status **/
#define PIOB_PDSR_P24		(1 << 24)
/** PIOB_PDSR_P23 Output Data Status **/
#define PIOB_PDSR_P23		(1 << 23)
/** PIOB_PDSR_P22 Output Data Status **/
#define PIOB_PDSR_P22		(1 << 22)
/** PIOB_PDSR_P21 Output Data Status **/
#define PIOB_PDSR_P21		(1 << 21)
/** PIOB_PDSR_P20 Output Data Status **/
#define PIOB_PDSR_P20		(1 << 20)
/** PIOB_PDSR_P19 Output Data Status **/
#define PIOB_PDSR_P19		(1 << 19)
/** PIOB_PDSR_P18 Output Data Status **/
#define PIOB_PDSR_P18		(1 << 18)
/** PIOB_PDSR_P17 Output Data Status **/
#define PIOB_PDSR_P17		(1 << 17)
/** PIOB_PDSR_P16 Output Data Status **/
#define PIOB_PDSR_P16		(1 << 16)
/** PIOB_PDSR_P15 Output Data Status **/
#define PIOB_PDSR_P15		(1 << 15)
/** PIOB_PDSR_P14 Output Data Status **/
#define PIOB_PDSR_P14		(1 << 14)
/** PIOB_PDSR_P13 Output Data Status **/
#define PIOB_PDSR_P13		(1 << 13)
/** PIOB_PDSR_P12 Output Data Status **/
#define PIOB_PDSR_P12		(1 << 12)
/** PIOB_PDSR_P11 Output Data Status **/
#define PIOB_PDSR_P11		(1 << 11)
/** PIOB_PDSR_P10 Output Data Status **/
#define PIOB_PDSR_P10		(1 << 10)
/** PIOB_PDSR_P9 Output Data Status **/
#define PIOB_PDSR_P9		(1 << 9)
/** PIOB_PDSR_P8 Output Data Status **/
#define PIOB_PDSR_P8		(1 << 8)
/** PIOB_PDSR_P7 Output Data Status **/
#define PIOB_PDSR_P7		(1 << 7)
/** PIOB_PDSR_P6 Output Data Status **/
#define PIOB_PDSR_P6		(1 << 6)
/** PIOB_PDSR_P5 Output Data Status **/
#define PIOB_PDSR_P5		(1 << 5)
/** PIOB_PDSR_P4 Output Data Status **/
#define PIOB_PDSR_P4		(1 << 4)
/** PIOB_PDSR_P3 Output Data Status **/
#define PIOB_PDSR_P3		(1 << 3)
/** PIOB_PDSR_P2 Output Data Status **/
#define PIOB_PDSR_P2		(1 << 2)
/** PIOB_PDSR_P1 Output Data Status **/
#define PIOB_PDSR_P1		(1 << 1)
/** PIOB_PDSR_P0 Output Data Status **/
#define PIOB_PDSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_ier IER Interrupt Enable Register
@{*/

/** PIOB_IER_P31 Input Change Interrupt Enable **/
#define PIOB_IER_P31		(1 << 31)
/** PIOB_IER_P30 Input Change Interrupt Enable **/
#define PIOB_IER_P30		(1 << 30)
/** PIOB_IER_P29 Input Change Interrupt Enable **/
#define PIOB_IER_P29		(1 << 29)
/** PIOB_IER_P28 Input Change Interrupt Enable **/
#define PIOB_IER_P28		(1 << 28)
/** PIOB_IER_P27 Input Change Interrupt Enable **/
#define PIOB_IER_P27		(1 << 27)
/** PIOB_IER_P26 Input Change Interrupt Enable **/
#define PIOB_IER_P26		(1 << 26)
/** PIOB_IER_P25 Input Change Interrupt Enable **/
#define PIOB_IER_P25		(1 << 25)
/** PIOB_IER_P24 Input Change Interrupt Enable **/
#define PIOB_IER_P24		(1 << 24)
/** PIOB_IER_P23 Input Change Interrupt Enable **/
#define PIOB_IER_P23		(1 << 23)
/** PIOB_IER_P22 Input Change Interrupt Enable **/
#define PIOB_IER_P22		(1 << 22)
/** PIOB_IER_P21 Input Change Interrupt Enable **/
#define PIOB_IER_P21		(1 << 21)
/** PIOB_IER_P20 Input Change Interrupt Enable **/
#define PIOB_IER_P20		(1 << 20)
/** PIOB_IER_P19 Input Change Interrupt Enable **/
#define PIOB_IER_P19		(1 << 19)
/** PIOB_IER_P18 Input Change Interrupt Enable **/
#define PIOB_IER_P18		(1 << 18)
/** PIOB_IER_P17 Input Change Interrupt Enable **/
#define PIOB_IER_P17		(1 << 17)
/** PIOB_IER_P16 Input Change Interrupt Enable **/
#define PIOB_IER_P16		(1 << 16)
/** PIOB_IER_P15 Input Change Interrupt Enable **/
#define PIOB_IER_P15		(1 << 15)
/** PIOB_IER_P14 Input Change Interrupt Enable **/
#define PIOB_IER_P14		(1 << 14)
/** PIOB_IER_P13 Input Change Interrupt Enable **/
#define PIOB_IER_P13		(1 << 13)
/** PIOB_IER_P12 Input Change Interrupt Enable **/
#define PIOB_IER_P12		(1 << 12)
/** PIOB_IER_P11 Input Change Interrupt Enable **/
#define PIOB_IER_P11		(1 << 11)
/** PIOB_IER_P10 Input Change Interrupt Enable **/
#define PIOB_IER_P10		(1 << 10)
/** PIOB_IER_P9 Input Change Interrupt Enable **/
#define PIOB_IER_P9		(1 << 9)
/** PIOB_IER_P8 Input Change Interrupt Enable **/
#define PIOB_IER_P8		(1 << 8)
/** PIOB_IER_P7 Input Change Interrupt Enable **/
#define PIOB_IER_P7		(1 << 7)
/** PIOB_IER_P6 Input Change Interrupt Enable **/
#define PIOB_IER_P6		(1 << 6)
/** PIOB_IER_P5 Input Change Interrupt Enable **/
#define PIOB_IER_P5		(1 << 5)
/** PIOB_IER_P4 Input Change Interrupt Enable **/
#define PIOB_IER_P4		(1 << 4)
/** PIOB_IER_P3 Input Change Interrupt Enable **/
#define PIOB_IER_P3		(1 << 3)
/** PIOB_IER_P2 Input Change Interrupt Enable **/
#define PIOB_IER_P2		(1 << 2)
/** PIOB_IER_P1 Input Change Interrupt Enable **/
#define PIOB_IER_P1		(1 << 1)
/** PIOB_IER_P0 Input Change Interrupt Enable **/
#define PIOB_IER_P0		(1 << 0)

/**@}*/

/** @defgroup piob_idr IDR Interrupt Disable Register
@{*/

/** PIOB_IDR_P31 Input Change Interrupt Disable **/
#define PIOB_IDR_P31		(1 << 31)
/** PIOB_IDR_P30 Input Change Interrupt Disable **/
#define PIOB_IDR_P30		(1 << 30)
/** PIOB_IDR_P29 Input Change Interrupt Disable **/
#define PIOB_IDR_P29		(1 << 29)
/** PIOB_IDR_P28 Input Change Interrupt Disable **/
#define PIOB_IDR_P28		(1 << 28)
/** PIOB_IDR_P27 Input Change Interrupt Disable **/
#define PIOB_IDR_P27		(1 << 27)
/** PIOB_IDR_P26 Input Change Interrupt Disable **/
#define PIOB_IDR_P26		(1 << 26)
/** PIOB_IDR_P25 Input Change Interrupt Disable **/
#define PIOB_IDR_P25		(1 << 25)
/** PIOB_IDR_P24 Input Change Interrupt Disable **/
#define PIOB_IDR_P24		(1 << 24)
/** PIOB_IDR_P23 Input Change Interrupt Disable **/
#define PIOB_IDR_P23		(1 << 23)
/** PIOB_IDR_P22 Input Change Interrupt Disable **/
#define PIOB_IDR_P22		(1 << 22)
/** PIOB_IDR_P21 Input Change Interrupt Disable **/
#define PIOB_IDR_P21		(1 << 21)
/** PIOB_IDR_P20 Input Change Interrupt Disable **/
#define PIOB_IDR_P20		(1 << 20)
/** PIOB_IDR_P19 Input Change Interrupt Disable **/
#define PIOB_IDR_P19		(1 << 19)
/** PIOB_IDR_P18 Input Change Interrupt Disable **/
#define PIOB_IDR_P18		(1 << 18)
/** PIOB_IDR_P17 Input Change Interrupt Disable **/
#define PIOB_IDR_P17		(1 << 17)
/** PIOB_IDR_P16 Input Change Interrupt Disable **/
#define PIOB_IDR_P16		(1 << 16)
/** PIOB_IDR_P15 Input Change Interrupt Disable **/
#define PIOB_IDR_P15		(1 << 15)
/** PIOB_IDR_P14 Input Change Interrupt Disable **/
#define PIOB_IDR_P14		(1 << 14)
/** PIOB_IDR_P13 Input Change Interrupt Disable **/
#define PIOB_IDR_P13		(1 << 13)
/** PIOB_IDR_P12 Input Change Interrupt Disable **/
#define PIOB_IDR_P12		(1 << 12)
/** PIOB_IDR_P11 Input Change Interrupt Disable **/
#define PIOB_IDR_P11		(1 << 11)
/** PIOB_IDR_P10 Input Change Interrupt Disable **/
#define PIOB_IDR_P10		(1 << 10)
/** PIOB_IDR_P9 Input Change Interrupt Disable **/
#define PIOB_IDR_P9		(1 << 9)
/** PIOB_IDR_P8 Input Change Interrupt Disable **/
#define PIOB_IDR_P8		(1 << 8)
/** PIOB_IDR_P7 Input Change Interrupt Disable **/
#define PIOB_IDR_P7		(1 << 7)
/** PIOB_IDR_P6 Input Change Interrupt Disable **/
#define PIOB_IDR_P6		(1 << 6)
/** PIOB_IDR_P5 Input Change Interrupt Disable **/
#define PIOB_IDR_P5		(1 << 5)
/** PIOB_IDR_P4 Input Change Interrupt Disable **/
#define PIOB_IDR_P4		(1 << 4)
/** PIOB_IDR_P3 Input Change Interrupt Disable **/
#define PIOB_IDR_P3		(1 << 3)
/** PIOB_IDR_P2 Input Change Interrupt Disable **/
#define PIOB_IDR_P2		(1 << 2)
/** PIOB_IDR_P1 Input Change Interrupt Disable **/
#define PIOB_IDR_P1		(1 << 1)
/** PIOB_IDR_P0 Input Change Interrupt Disable **/
#define PIOB_IDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_imr IMR Interrupt Mask Register
@{*/

/** PIOB_IMR_P31 Input Change Interrupt Mask **/
#define PIOB_IMR_P31		(1 << 31)
/** PIOB_IMR_P30 Input Change Interrupt Mask **/
#define PIOB_IMR_P30		(1 << 30)
/** PIOB_IMR_P29 Input Change Interrupt Mask **/
#define PIOB_IMR_P29		(1 << 29)
/** PIOB_IMR_P28 Input Change Interrupt Mask **/
#define PIOB_IMR_P28		(1 << 28)
/** PIOB_IMR_P27 Input Change Interrupt Mask **/
#define PIOB_IMR_P27		(1 << 27)
/** PIOB_IMR_P26 Input Change Interrupt Mask **/
#define PIOB_IMR_P26		(1 << 26)
/** PIOB_IMR_P25 Input Change Interrupt Mask **/
#define PIOB_IMR_P25		(1 << 25)
/** PIOB_IMR_P24 Input Change Interrupt Mask **/
#define PIOB_IMR_P24		(1 << 24)
/** PIOB_IMR_P23 Input Change Interrupt Mask **/
#define PIOB_IMR_P23		(1 << 23)
/** PIOB_IMR_P22 Input Change Interrupt Mask **/
#define PIOB_IMR_P22		(1 << 22)
/** PIOB_IMR_P21 Input Change Interrupt Mask **/
#define PIOB_IMR_P21		(1 << 21)
/** PIOB_IMR_P20 Input Change Interrupt Mask **/
#define PIOB_IMR_P20		(1 << 20)
/** PIOB_IMR_P19 Input Change Interrupt Mask **/
#define PIOB_IMR_P19		(1 << 19)
/** PIOB_IMR_P18 Input Change Interrupt Mask **/
#define PIOB_IMR_P18		(1 << 18)
/** PIOB_IMR_P17 Input Change Interrupt Mask **/
#define PIOB_IMR_P17		(1 << 17)
/** PIOB_IMR_P16 Input Change Interrupt Mask **/
#define PIOB_IMR_P16		(1 << 16)
/** PIOB_IMR_P15 Input Change Interrupt Mask **/
#define PIOB_IMR_P15		(1 << 15)
/** PIOB_IMR_P14 Input Change Interrupt Mask **/
#define PIOB_IMR_P14		(1 << 14)
/** PIOB_IMR_P13 Input Change Interrupt Mask **/
#define PIOB_IMR_P13		(1 << 13)
/** PIOB_IMR_P12 Input Change Interrupt Mask **/
#define PIOB_IMR_P12		(1 << 12)
/** PIOB_IMR_P11 Input Change Interrupt Mask **/
#define PIOB_IMR_P11		(1 << 11)
/** PIOB_IMR_P10 Input Change Interrupt Mask **/
#define PIOB_IMR_P10		(1 << 10)
/** PIOB_IMR_P9 Input Change Interrupt Mask **/
#define PIOB_IMR_P9		(1 << 9)
/** PIOB_IMR_P8 Input Change Interrupt Mask **/
#define PIOB_IMR_P8		(1 << 8)
/** PIOB_IMR_P7 Input Change Interrupt Mask **/
#define PIOB_IMR_P7		(1 << 7)
/** PIOB_IMR_P6 Input Change Interrupt Mask **/
#define PIOB_IMR_P6		(1 << 6)
/** PIOB_IMR_P5 Input Change Interrupt Mask **/
#define PIOB_IMR_P5		(1 << 5)
/** PIOB_IMR_P4 Input Change Interrupt Mask **/
#define PIOB_IMR_P4		(1 << 4)
/** PIOB_IMR_P3 Input Change Interrupt Mask **/
#define PIOB_IMR_P3		(1 << 3)
/** PIOB_IMR_P2 Input Change Interrupt Mask **/
#define PIOB_IMR_P2		(1 << 2)
/** PIOB_IMR_P1 Input Change Interrupt Mask **/
#define PIOB_IMR_P1		(1 << 1)
/** PIOB_IMR_P0 Input Change Interrupt Mask **/
#define PIOB_IMR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_isr ISR Interrupt Status Register
@{*/

/** PIOB_ISR_P31 Input Change Interrupt Status **/
#define PIOB_ISR_P31		(1 << 31)
/** PIOB_ISR_P30 Input Change Interrupt Status **/
#define PIOB_ISR_P30		(1 << 30)
/** PIOB_ISR_P29 Input Change Interrupt Status **/
#define PIOB_ISR_P29		(1 << 29)
/** PIOB_ISR_P28 Input Change Interrupt Status **/
#define PIOB_ISR_P28		(1 << 28)
/** PIOB_ISR_P27 Input Change Interrupt Status **/
#define PIOB_ISR_P27		(1 << 27)
/** PIOB_ISR_P26 Input Change Interrupt Status **/
#define PIOB_ISR_P26		(1 << 26)
/** PIOB_ISR_P25 Input Change Interrupt Status **/
#define PIOB_ISR_P25		(1 << 25)
/** PIOB_ISR_P24 Input Change Interrupt Status **/
#define PIOB_ISR_P24		(1 << 24)
/** PIOB_ISR_P23 Input Change Interrupt Status **/
#define PIOB_ISR_P23		(1 << 23)
/** PIOB_ISR_P22 Input Change Interrupt Status **/
#define PIOB_ISR_P22		(1 << 22)
/** PIOB_ISR_P21 Input Change Interrupt Status **/
#define PIOB_ISR_P21		(1 << 21)
/** PIOB_ISR_P20 Input Change Interrupt Status **/
#define PIOB_ISR_P20		(1 << 20)
/** PIOB_ISR_P19 Input Change Interrupt Status **/
#define PIOB_ISR_P19		(1 << 19)
/** PIOB_ISR_P18 Input Change Interrupt Status **/
#define PIOB_ISR_P18		(1 << 18)
/** PIOB_ISR_P17 Input Change Interrupt Status **/
#define PIOB_ISR_P17		(1 << 17)
/** PIOB_ISR_P16 Input Change Interrupt Status **/
#define PIOB_ISR_P16		(1 << 16)
/** PIOB_ISR_P15 Input Change Interrupt Status **/
#define PIOB_ISR_P15		(1 << 15)
/** PIOB_ISR_P14 Input Change Interrupt Status **/
#define PIOB_ISR_P14		(1 << 14)
/** PIOB_ISR_P13 Input Change Interrupt Status **/
#define PIOB_ISR_P13		(1 << 13)
/** PIOB_ISR_P12 Input Change Interrupt Status **/
#define PIOB_ISR_P12		(1 << 12)
/** PIOB_ISR_P11 Input Change Interrupt Status **/
#define PIOB_ISR_P11		(1 << 11)
/** PIOB_ISR_P10 Input Change Interrupt Status **/
#define PIOB_ISR_P10		(1 << 10)
/** PIOB_ISR_P9 Input Change Interrupt Status **/
#define PIOB_ISR_P9		(1 << 9)
/** PIOB_ISR_P8 Input Change Interrupt Status **/
#define PIOB_ISR_P8		(1 << 8)
/** PIOB_ISR_P7 Input Change Interrupt Status **/
#define PIOB_ISR_P7		(1 << 7)
/** PIOB_ISR_P6 Input Change Interrupt Status **/
#define PIOB_ISR_P6		(1 << 6)
/** PIOB_ISR_P5 Input Change Interrupt Status **/
#define PIOB_ISR_P5		(1 << 5)
/** PIOB_ISR_P4 Input Change Interrupt Status **/
#define PIOB_ISR_P4		(1 << 4)
/** PIOB_ISR_P3 Input Change Interrupt Status **/
#define PIOB_ISR_P3		(1 << 3)
/** PIOB_ISR_P2 Input Change Interrupt Status **/
#define PIOB_ISR_P2		(1 << 2)
/** PIOB_ISR_P1 Input Change Interrupt Status **/
#define PIOB_ISR_P1		(1 << 1)
/** PIOB_ISR_P0 Input Change Interrupt Status **/
#define PIOB_ISR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_mder MDER Multi-driver Enable Register
@{*/

/** PIOB_MDER_P31 Multi Drive Enable. **/
#define PIOB_MDER_P31		(1 << 31)
/** PIOB_MDER_P30 Multi Drive Enable. **/
#define PIOB_MDER_P30		(1 << 30)
/** PIOB_MDER_P29 Multi Drive Enable. **/
#define PIOB_MDER_P29		(1 << 29)
/** PIOB_MDER_P28 Multi Drive Enable. **/
#define PIOB_MDER_P28		(1 << 28)
/** PIOB_MDER_P27 Multi Drive Enable. **/
#define PIOB_MDER_P27		(1 << 27)
/** PIOB_MDER_P26 Multi Drive Enable. **/
#define PIOB_MDER_P26		(1 << 26)
/** PIOB_MDER_P25 Multi Drive Enable. **/
#define PIOB_MDER_P25		(1 << 25)
/** PIOB_MDER_P24 Multi Drive Enable. **/
#define PIOB_MDER_P24		(1 << 24)
/** PIOB_MDER_P23 Multi Drive Enable. **/
#define PIOB_MDER_P23		(1 << 23)
/** PIOB_MDER_P22 Multi Drive Enable. **/
#define PIOB_MDER_P22		(1 << 22)
/** PIOB_MDER_P21 Multi Drive Enable. **/
#define PIOB_MDER_P21		(1 << 21)
/** PIOB_MDER_P20 Multi Drive Enable. **/
#define PIOB_MDER_P20		(1 << 20)
/** PIOB_MDER_P19 Multi Drive Enable. **/
#define PIOB_MDER_P19		(1 << 19)
/** PIOB_MDER_P18 Multi Drive Enable. **/
#define PIOB_MDER_P18		(1 << 18)
/** PIOB_MDER_P17 Multi Drive Enable. **/
#define PIOB_MDER_P17		(1 << 17)
/** PIOB_MDER_P16 Multi Drive Enable. **/
#define PIOB_MDER_P16		(1 << 16)
/** PIOB_MDER_P15 Multi Drive Enable. **/
#define PIOB_MDER_P15		(1 << 15)
/** PIOB_MDER_P14 Multi Drive Enable. **/
#define PIOB_MDER_P14		(1 << 14)
/** PIOB_MDER_P13 Multi Drive Enable. **/
#define PIOB_MDER_P13		(1 << 13)
/** PIOB_MDER_P12 Multi Drive Enable. **/
#define PIOB_MDER_P12		(1 << 12)
/** PIOB_MDER_P11 Multi Drive Enable. **/
#define PIOB_MDER_P11		(1 << 11)
/** PIOB_MDER_P10 Multi Drive Enable. **/
#define PIOB_MDER_P10		(1 << 10)
/** PIOB_MDER_P9 Multi Drive Enable. **/
#define PIOB_MDER_P9		(1 << 9)
/** PIOB_MDER_P8 Multi Drive Enable. **/
#define PIOB_MDER_P8		(1 << 8)
/** PIOB_MDER_P7 Multi Drive Enable. **/
#define PIOB_MDER_P7		(1 << 7)
/** PIOB_MDER_P6 Multi Drive Enable. **/
#define PIOB_MDER_P6		(1 << 6)
/** PIOB_MDER_P5 Multi Drive Enable. **/
#define PIOB_MDER_P5		(1 << 5)
/** PIOB_MDER_P4 Multi Drive Enable. **/
#define PIOB_MDER_P4		(1 << 4)
/** PIOB_MDER_P3 Multi Drive Enable. **/
#define PIOB_MDER_P3		(1 << 3)
/** PIOB_MDER_P2 Multi Drive Enable. **/
#define PIOB_MDER_P2		(1 << 2)
/** PIOB_MDER_P1 Multi Drive Enable. **/
#define PIOB_MDER_P1		(1 << 1)
/** PIOB_MDER_P0 Multi Drive Enable. **/
#define PIOB_MDER_P0		(1 << 0)

/**@}*/

/** @defgroup piob_mddr MDDR Multi-driver Disable Register
@{*/

/** PIOB_MDDR_P31 Multi Drive Disable. **/
#define PIOB_MDDR_P31		(1 << 31)
/** PIOB_MDDR_P30 Multi Drive Disable. **/
#define PIOB_MDDR_P30		(1 << 30)
/** PIOB_MDDR_P29 Multi Drive Disable. **/
#define PIOB_MDDR_P29		(1 << 29)
/** PIOB_MDDR_P28 Multi Drive Disable. **/
#define PIOB_MDDR_P28		(1 << 28)
/** PIOB_MDDR_P27 Multi Drive Disable. **/
#define PIOB_MDDR_P27		(1 << 27)
/** PIOB_MDDR_P26 Multi Drive Disable. **/
#define PIOB_MDDR_P26		(1 << 26)
/** PIOB_MDDR_P25 Multi Drive Disable. **/
#define PIOB_MDDR_P25		(1 << 25)
/** PIOB_MDDR_P24 Multi Drive Disable. **/
#define PIOB_MDDR_P24		(1 << 24)
/** PIOB_MDDR_P23 Multi Drive Disable. **/
#define PIOB_MDDR_P23		(1 << 23)
/** PIOB_MDDR_P22 Multi Drive Disable. **/
#define PIOB_MDDR_P22		(1 << 22)
/** PIOB_MDDR_P21 Multi Drive Disable. **/
#define PIOB_MDDR_P21		(1 << 21)
/** PIOB_MDDR_P20 Multi Drive Disable. **/
#define PIOB_MDDR_P20		(1 << 20)
/** PIOB_MDDR_P19 Multi Drive Disable. **/
#define PIOB_MDDR_P19		(1 << 19)
/** PIOB_MDDR_P18 Multi Drive Disable. **/
#define PIOB_MDDR_P18		(1 << 18)
/** PIOB_MDDR_P17 Multi Drive Disable. **/
#define PIOB_MDDR_P17		(1 << 17)
/** PIOB_MDDR_P16 Multi Drive Disable. **/
#define PIOB_MDDR_P16		(1 << 16)
/** PIOB_MDDR_P15 Multi Drive Disable. **/
#define PIOB_MDDR_P15		(1 << 15)
/** PIOB_MDDR_P14 Multi Drive Disable. **/
#define PIOB_MDDR_P14		(1 << 14)
/** PIOB_MDDR_P13 Multi Drive Disable. **/
#define PIOB_MDDR_P13		(1 << 13)
/** PIOB_MDDR_P12 Multi Drive Disable. **/
#define PIOB_MDDR_P12		(1 << 12)
/** PIOB_MDDR_P11 Multi Drive Disable. **/
#define PIOB_MDDR_P11		(1 << 11)
/** PIOB_MDDR_P10 Multi Drive Disable. **/
#define PIOB_MDDR_P10		(1 << 10)
/** PIOB_MDDR_P9 Multi Drive Disable. **/
#define PIOB_MDDR_P9		(1 << 9)
/** PIOB_MDDR_P8 Multi Drive Disable. **/
#define PIOB_MDDR_P8		(1 << 8)
/** PIOB_MDDR_P7 Multi Drive Disable. **/
#define PIOB_MDDR_P7		(1 << 7)
/** PIOB_MDDR_P6 Multi Drive Disable. **/
#define PIOB_MDDR_P6		(1 << 6)
/** PIOB_MDDR_P5 Multi Drive Disable. **/
#define PIOB_MDDR_P5		(1 << 5)
/** PIOB_MDDR_P4 Multi Drive Disable. **/
#define PIOB_MDDR_P4		(1 << 4)
/** PIOB_MDDR_P3 Multi Drive Disable. **/
#define PIOB_MDDR_P3		(1 << 3)
/** PIOB_MDDR_P2 Multi Drive Disable. **/
#define PIOB_MDDR_P2		(1 << 2)
/** PIOB_MDDR_P1 Multi Drive Disable. **/
#define PIOB_MDDR_P1		(1 << 1)
/** PIOB_MDDR_P0 Multi Drive Disable. **/
#define PIOB_MDDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_mdsr MDSR Multi-driver Status Register
@{*/

/** PIOB_MDSR_P31 Multi Drive Status. **/
#define PIOB_MDSR_P31		(1 << 31)
/** PIOB_MDSR_P30 Multi Drive Status. **/
#define PIOB_MDSR_P30		(1 << 30)
/** PIOB_MDSR_P29 Multi Drive Status. **/
#define PIOB_MDSR_P29		(1 << 29)
/** PIOB_MDSR_P28 Multi Drive Status. **/
#define PIOB_MDSR_P28		(1 << 28)
/** PIOB_MDSR_P27 Multi Drive Status. **/
#define PIOB_MDSR_P27		(1 << 27)
/** PIOB_MDSR_P26 Multi Drive Status. **/
#define PIOB_MDSR_P26		(1 << 26)
/** PIOB_MDSR_P25 Multi Drive Status. **/
#define PIOB_MDSR_P25		(1 << 25)
/** PIOB_MDSR_P24 Multi Drive Status. **/
#define PIOB_MDSR_P24		(1 << 24)
/** PIOB_MDSR_P23 Multi Drive Status. **/
#define PIOB_MDSR_P23		(1 << 23)
/** PIOB_MDSR_P22 Multi Drive Status. **/
#define PIOB_MDSR_P22		(1 << 22)
/** PIOB_MDSR_P21 Multi Drive Status. **/
#define PIOB_MDSR_P21		(1 << 21)
/** PIOB_MDSR_P20 Multi Drive Status. **/
#define PIOB_MDSR_P20		(1 << 20)
/** PIOB_MDSR_P19 Multi Drive Status. **/
#define PIOB_MDSR_P19		(1 << 19)
/** PIOB_MDSR_P18 Multi Drive Status. **/
#define PIOB_MDSR_P18		(1 << 18)
/** PIOB_MDSR_P17 Multi Drive Status. **/
#define PIOB_MDSR_P17		(1 << 17)
/** PIOB_MDSR_P16 Multi Drive Status. **/
#define PIOB_MDSR_P16		(1 << 16)
/** PIOB_MDSR_P15 Multi Drive Status. **/
#define PIOB_MDSR_P15		(1 << 15)
/** PIOB_MDSR_P14 Multi Drive Status. **/
#define PIOB_MDSR_P14		(1 << 14)
/** PIOB_MDSR_P13 Multi Drive Status. **/
#define PIOB_MDSR_P13		(1 << 13)
/** PIOB_MDSR_P12 Multi Drive Status. **/
#define PIOB_MDSR_P12		(1 << 12)
/** PIOB_MDSR_P11 Multi Drive Status. **/
#define PIOB_MDSR_P11		(1 << 11)
/** PIOB_MDSR_P10 Multi Drive Status. **/
#define PIOB_MDSR_P10		(1 << 10)
/** PIOB_MDSR_P9 Multi Drive Status. **/
#define PIOB_MDSR_P9		(1 << 9)
/** PIOB_MDSR_P8 Multi Drive Status. **/
#define PIOB_MDSR_P8		(1 << 8)
/** PIOB_MDSR_P7 Multi Drive Status. **/
#define PIOB_MDSR_P7		(1 << 7)
/** PIOB_MDSR_P6 Multi Drive Status. **/
#define PIOB_MDSR_P6		(1 << 6)
/** PIOB_MDSR_P5 Multi Drive Status. **/
#define PIOB_MDSR_P5		(1 << 5)
/** PIOB_MDSR_P4 Multi Drive Status. **/
#define PIOB_MDSR_P4		(1 << 4)
/** PIOB_MDSR_P3 Multi Drive Status. **/
#define PIOB_MDSR_P3		(1 << 3)
/** PIOB_MDSR_P2 Multi Drive Status. **/
#define PIOB_MDSR_P2		(1 << 2)
/** PIOB_MDSR_P1 Multi Drive Status. **/
#define PIOB_MDSR_P1		(1 << 1)
/** PIOB_MDSR_P0 Multi Drive Status. **/
#define PIOB_MDSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pudr PUDR Pull-up Disable Register
@{*/

