grevaillot/svd_tools/headers/ATSAM3X8H/piob.h
/** PIOB_PUDR_P31 Pull Up Disable. **/
#define PIOB_PUDR_P31		(1 << 31)
/** PIOB_PUDR_P30 Pull Up Disable. **/
#define PIOB_PUDR_P30		(1 << 30)
/** PIOB_PUDR_P29 Pull Up Disable. **/
#define PIOB_PUDR_P29		(1 << 29)
/** PIOB_PUDR_P28 Pull Up Disable. **/
#define PIOB_PUDR_P28		(1 << 28)
/** PIOB_PUDR_P27 Pull Up Disable. **/
#define PIOB_PUDR_P27		(1 << 27)
/** PIOB_PUDR_P26 Pull Up Disable. **/
#define PIOB_PUDR_P26		(1 << 26)
/** PIOB_PUDR_P25 Pull Up Disable. **/
#define PIOB_PUDR_P25		(1 << 25)
/** PIOB_PUDR_P24 Pull Up Disable. **/
#define PIOB_PUDR_P24		(1 << 24)
/** PIOB_PUDR_P23 Pull Up Disable. **/
#define PIOB_PUDR_P23		(1 << 23)
/** PIOB_PUDR_P22 Pull Up Disable. **/
#define PIOB_PUDR_P22		(1 << 22)
/** PIOB_PUDR_P21 Pull Up Disable. **/
#define PIOB_PUDR_P21		(1 << 21)
/** PIOB_PUDR_P20 Pull Up Disable. **/
#define PIOB_PUDR_P20		(1 << 20)
/** PIOB_PUDR_P19 Pull Up Disable. **/
#define PIOB_PUDR_P19		(1 << 19)
/** PIOB_PUDR_P18 Pull Up Disable. **/
#define PIOB_PUDR_P18		(1 << 18)
/** PIOB_PUDR_P17 Pull Up Disable. **/
#define PIOB_PUDR_P17		(1 << 17)
/** PIOB_PUDR_P16 Pull Up Disable. **/
#define PIOB_PUDR_P16		(1 << 16)
/** PIOB_PUDR_P15 Pull Up Disable. **/
#define PIOB_PUDR_P15		(1 << 15)
/** PIOB_PUDR_P14 Pull Up Disable. **/
#define PIOB_PUDR_P14		(1 << 14)
/** PIOB_PUDR_P13 Pull Up Disable. **/
#define PIOB_PUDR_P13		(1 << 13)
/** PIOB_PUDR_P12 Pull Up Disable. **/
#define PIOB_PUDR_P12		(1 << 12)
/** PIOB_PUDR_P11 Pull Up Disable. **/
#define PIOB_PUDR_P11		(1 << 11)
/** PIOB_PUDR_P10 Pull Up Disable. **/
#define PIOB_PUDR_P10		(1 << 10)
/** PIOB_PUDR_P9 Pull Up Disable. **/
#define PIOB_PUDR_P9		(1 << 9)
/** PIOB_PUDR_P8 Pull Up Disable. **/
#define PIOB_PUDR_P8		(1 << 8)
/** PIOB_PUDR_P7 Pull Up Disable. **/
#define PIOB_PUDR_P7		(1 << 7)
/** PIOB_PUDR_P6 Pull Up Disable. **/
#define PIOB_PUDR_P6		(1 << 6)
/** PIOB_PUDR_P5 Pull Up Disable. **/
#define PIOB_PUDR_P5		(1 << 5)
/** PIOB_PUDR_P4 Pull Up Disable. **/
#define PIOB_PUDR_P4		(1 << 4)
/** PIOB_PUDR_P3 Pull Up Disable. **/
#define PIOB_PUDR_P3		(1 << 3)
/** PIOB_PUDR_P2 Pull Up Disable. **/
#define PIOB_PUDR_P2		(1 << 2)
/** PIOB_PUDR_P1 Pull Up Disable. **/
#define PIOB_PUDR_P1		(1 << 1)
/** PIOB_PUDR_P0 Pull Up Disable. **/
#define PIOB_PUDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_puer PUER Pull-up Enable Register
@{*/

/** PIOB_PUER_P31 Pull Up Enable. **/
#define PIOB_PUER_P31		(1 << 31)
/** PIOB_PUER_P30 Pull Up Enable. **/
#define PIOB_PUER_P30		(1 << 30)
/** PIOB_PUER_P29 Pull Up Enable. **/
#define PIOB_PUER_P29		(1 << 29)
/** PIOB_PUER_P28 Pull Up Enable. **/
#define PIOB_PUER_P28		(1 << 28)
/** PIOB_PUER_P27 Pull Up Enable. **/
#define PIOB_PUER_P27		(1 << 27)
/** PIOB_PUER_P26 Pull Up Enable. **/
#define PIOB_PUER_P26		(1 << 26)
/** PIOB_PUER_P25 Pull Up Enable. **/
#define PIOB_PUER_P25		(1 << 25)
/** PIOB_PUER_P24 Pull Up Enable. **/
#define PIOB_PUER_P24		(1 << 24)
/** PIOB_PUER_P23 Pull Up Enable. **/
#define PIOB_PUER_P23		(1 << 23)
/** PIOB_PUER_P22 Pull Up Enable. **/
#define PIOB_PUER_P22		(1 << 22)
/** PIOB_PUER_P21 Pull Up Enable. **/
#define PIOB_PUER_P21		(1 << 21)
/** PIOB_PUER_P20 Pull Up Enable. **/
#define PIOB_PUER_P20		(1 << 20)
/** PIOB_PUER_P19 Pull Up Enable. **/
#define PIOB_PUER_P19		(1 << 19)
/** PIOB_PUER_P18 Pull Up Enable. **/
#define PIOB_PUER_P18		(1 << 18)
/** PIOB_PUER_P17 Pull Up Enable. **/
#define PIOB_PUER_P17		(1 << 17)
/** PIOB_PUER_P16 Pull Up Enable. **/
#define PIOB_PUER_P16		(1 << 16)
/** PIOB_PUER_P15 Pull Up Enable. **/
#define PIOB_PUER_P15		(1 << 15)
/** PIOB_PUER_P14 Pull Up Enable. **/
#define PIOB_PUER_P14		(1 << 14)
/** PIOB_PUER_P13 Pull Up Enable. **/
#define PIOB_PUER_P13		(1 << 13)
/** PIOB_PUER_P12 Pull Up Enable. **/
#define PIOB_PUER_P12		(1 << 12)
/** PIOB_PUER_P11 Pull Up Enable. **/
#define PIOB_PUER_P11		(1 << 11)
/** PIOB_PUER_P10 Pull Up Enable. **/
#define PIOB_PUER_P10		(1 << 10)
/** PIOB_PUER_P9 Pull Up Enable. **/
#define PIOB_PUER_P9		(1 << 9)
/** PIOB_PUER_P8 Pull Up Enable. **/
#define PIOB_PUER_P8		(1 << 8)
/** PIOB_PUER_P7 Pull Up Enable. **/
#define PIOB_PUER_P7		(1 << 7)
/** PIOB_PUER_P6 Pull Up Enable. **/
#define PIOB_PUER_P6		(1 << 6)
/** PIOB_PUER_P5 Pull Up Enable. **/
#define PIOB_PUER_P5		(1 << 5)
/** PIOB_PUER_P4 Pull Up Enable. **/
#define PIOB_PUER_P4		(1 << 4)
/** PIOB_PUER_P3 Pull Up Enable. **/
#define PIOB_PUER_P3		(1 << 3)
/** PIOB_PUER_P2 Pull Up Enable. **/
#define PIOB_PUER_P2		(1 << 2)
/** PIOB_PUER_P1 Pull Up Enable. **/
#define PIOB_PUER_P1		(1 << 1)
/** PIOB_PUER_P0 Pull Up Enable. **/
#define PIOB_PUER_P0		(1 << 0)

/**@}*/

/** @defgroup piob_pusr PUSR Pad Pull-up Status Register
@{*/

/** PIOB_PUSR_P31 Pull Up Status. **/
#define PIOB_PUSR_P31		(1 << 31)
/** PIOB_PUSR_P30 Pull Up Status. **/
#define PIOB_PUSR_P30		(1 << 30)
/** PIOB_PUSR_P29 Pull Up Status. **/
#define PIOB_PUSR_P29		(1 << 29)
/** PIOB_PUSR_P28 Pull Up Status. **/
#define PIOB_PUSR_P28		(1 << 28)
/** PIOB_PUSR_P27 Pull Up Status. **/
#define PIOB_PUSR_P27		(1 << 27)
/** PIOB_PUSR_P26 Pull Up Status. **/
#define PIOB_PUSR_P26		(1 << 26)
/** PIOB_PUSR_P25 Pull Up Status. **/
#define PIOB_PUSR_P25		(1 << 25)
/** PIOB_PUSR_P24 Pull Up Status. **/
#define PIOB_PUSR_P24		(1 << 24)
/** PIOB_PUSR_P23 Pull Up Status. **/
#define PIOB_PUSR_P23		(1 << 23)
/** PIOB_PUSR_P22 Pull Up Status. **/
#define PIOB_PUSR_P22		(1 << 22)
/** PIOB_PUSR_P21 Pull Up Status. **/
#define PIOB_PUSR_P21		(1 << 21)
/** PIOB_PUSR_P20 Pull Up Status. **/
#define PIOB_PUSR_P20		(1 << 20)
/** PIOB_PUSR_P19 Pull Up Status. **/
#define PIOB_PUSR_P19		(1 << 19)
/** PIOB_PUSR_P18 Pull Up Status. **/
#define PIOB_PUSR_P18		(1 << 18)
/** PIOB_PUSR_P17 Pull Up Status. **/
#define PIOB_PUSR_P17		(1 << 17)
/** PIOB_PUSR_P16 Pull Up Status. **/
#define PIOB_PUSR_P16		(1 << 16)
/** PIOB_PUSR_P15 Pull Up Status. **/
#define PIOB_PUSR_P15		(1 << 15)
/** PIOB_PUSR_P14 Pull Up Status. **/
#define PIOB_PUSR_P14		(1 << 14)
/** PIOB_PUSR_P13 Pull Up Status. **/
#define PIOB_PUSR_P13		(1 << 13)
/** PIOB_PUSR_P12 Pull Up Status. **/
#define PIOB_PUSR_P12		(1 << 12)
/** PIOB_PUSR_P11 Pull Up Status. **/
#define PIOB_PUSR_P11		(1 << 11)
/** PIOB_PUSR_P10 Pull Up Status. **/
#define PIOB_PUSR_P10		(1 << 10)
/** PIOB_PUSR_P9 Pull Up Status. **/
#define PIOB_PUSR_P9		(1 << 9)
/** PIOB_PUSR_P8 Pull Up Status. **/
#define PIOB_PUSR_P8		(1 << 8)
/** PIOB_PUSR_P7 Pull Up Status. **/
#define PIOB_PUSR_P7		(1 << 7)
/** PIOB_PUSR_P6 Pull Up Status. **/
#define PIOB_PUSR_P6		(1 << 6)
/** PIOB_PUSR_P5 Pull Up Status. **/
#define PIOB_PUSR_P5		(1 << 5)
/** PIOB_PUSR_P4 Pull Up Status. **/
#define PIOB_PUSR_P4		(1 << 4)
/** PIOB_PUSR_P3 Pull Up Status. **/
#define PIOB_PUSR_P3		(1 << 3)
/** PIOB_PUSR_P2 Pull Up Status. **/
#define PIOB_PUSR_P2		(1 << 2)
/** PIOB_PUSR_P1 Pull Up Status. **/
#define PIOB_PUSR_P1		(1 << 1)
/** PIOB_PUSR_P0 Pull Up Status. **/
#define PIOB_PUSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_absr ABSR Peripheral AB Select Register
@{*/

/** PIOB_ABSR_P31 Peripheral A Select. **/
#define PIOB_ABSR_P31		(1 << 31)
/** PIOB_ABSR_P30 Peripheral A Select. **/
#define PIOB_ABSR_P30		(1 << 30)
/** PIOB_ABSR_P29 Peripheral A Select. **/
#define PIOB_ABSR_P29		(1 << 29)
/** PIOB_ABSR_P28 Peripheral A Select. **/
#define PIOB_ABSR_P28		(1 << 28)
/** PIOB_ABSR_P27 Peripheral A Select. **/
#define PIOB_ABSR_P27		(1 << 27)
/** PIOB_ABSR_P26 Peripheral A Select. **/
#define PIOB_ABSR_P26		(1 << 26)
/** PIOB_ABSR_P25 Peripheral A Select. **/
#define PIOB_ABSR_P25		(1 << 25)
/** PIOB_ABSR_P24 Peripheral A Select. **/
#define PIOB_ABSR_P24		(1 << 24)
/** PIOB_ABSR_P23 Peripheral A Select. **/
#define PIOB_ABSR_P23		(1 << 23)
/** PIOB_ABSR_P22 Peripheral A Select. **/
#define PIOB_ABSR_P22		(1 << 22)
/** PIOB_ABSR_P21 Peripheral A Select. **/
#define PIOB_ABSR_P21		(1 << 21)
/** PIOB_ABSR_P20 Peripheral A Select. **/
#define PIOB_ABSR_P20		(1 << 20)
/** PIOB_ABSR_P19 Peripheral A Select. **/
#define PIOB_ABSR_P19		(1 << 19)
/** PIOB_ABSR_P18 Peripheral A Select. **/
#define PIOB_ABSR_P18		(1 << 18)
/** PIOB_ABSR_P17 Peripheral A Select. **/
#define PIOB_ABSR_P17		(1 << 17)
/** PIOB_ABSR_P16 Peripheral A Select. **/
#define PIOB_ABSR_P16		(1 << 16)
/** PIOB_ABSR_P15 Peripheral A Select. **/
#define PIOB_ABSR_P15		(1 << 15)
/** PIOB_ABSR_P14 Peripheral A Select. **/
#define PIOB_ABSR_P14		(1 << 14)
/** PIOB_ABSR_P13 Peripheral A Select. **/
#define PIOB_ABSR_P13		(1 << 13)
/** PIOB_ABSR_P12 Peripheral A Select. **/
#define PIOB_ABSR_P12		(1 << 12)
/** PIOB_ABSR_P11 Peripheral A Select. **/
#define PIOB_ABSR_P11		(1 << 11)
/** PIOB_ABSR_P10 Peripheral A Select. **/
#define PIOB_ABSR_P10		(1 << 10)
/** PIOB_ABSR_P9 Peripheral A Select. **/
#define PIOB_ABSR_P9		(1 << 9)
/** PIOB_ABSR_P8 Peripheral A Select. **/
#define PIOB_ABSR_P8		(1 << 8)
/** PIOB_ABSR_P7 Peripheral A Select. **/
#define PIOB_ABSR_P7		(1 << 7)
/** PIOB_ABSR_P6 Peripheral A Select. **/
#define PIOB_ABSR_P6		(1 << 6)
/** PIOB_ABSR_P5 Peripheral A Select. **/
#define PIOB_ABSR_P5		(1 << 5)
/** PIOB_ABSR_P4 Peripheral A Select. **/
#define PIOB_ABSR_P4		(1 << 4)
/** PIOB_ABSR_P3 Peripheral A Select. **/
#define PIOB_ABSR_P3		(1 << 3)
/** PIOB_ABSR_P2 Peripheral A Select. **/
#define PIOB_ABSR_P2		(1 << 2)
/** PIOB_ABSR_P1 Peripheral A Select. **/
#define PIOB_ABSR_P1		(1 << 1)
/** PIOB_ABSR_P0 Peripheral A Select. **/
#define PIOB_ABSR_P0		(1 << 0)

/**@}*/

