grevaillot/svd_tools/headers/ATSAM3X8H/piob.h
/** @defgroup piob_scifsr SCIFSR System Clock Glitch Input Filter Select Register
@{*/

/** PIOB_SCIFSR_P31 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P31		(1 << 31)
/** PIOB_SCIFSR_P30 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P30		(1 << 30)
/** PIOB_SCIFSR_P29 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P29		(1 << 29)
/** PIOB_SCIFSR_P28 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P28		(1 << 28)
/** PIOB_SCIFSR_P27 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P27		(1 << 27)
/** PIOB_SCIFSR_P26 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P26		(1 << 26)
/** PIOB_SCIFSR_P25 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P25		(1 << 25)
/** PIOB_SCIFSR_P24 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P24		(1 << 24)
/** PIOB_SCIFSR_P23 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P23		(1 << 23)
/** PIOB_SCIFSR_P22 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P22		(1 << 22)
/** PIOB_SCIFSR_P21 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P21		(1 << 21)
/** PIOB_SCIFSR_P20 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P20		(1 << 20)
/** PIOB_SCIFSR_P19 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P19		(1 << 19)
/** PIOB_SCIFSR_P18 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P18		(1 << 18)
/** PIOB_SCIFSR_P17 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P17		(1 << 17)
/** PIOB_SCIFSR_P16 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P16		(1 << 16)
/** PIOB_SCIFSR_P15 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P15		(1 << 15)
/** PIOB_SCIFSR_P14 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P14		(1 << 14)
/** PIOB_SCIFSR_P13 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P13		(1 << 13)
/** PIOB_SCIFSR_P12 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P12		(1 << 12)
/** PIOB_SCIFSR_P11 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P11		(1 << 11)
/** PIOB_SCIFSR_P10 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P10		(1 << 10)
/** PIOB_SCIFSR_P9 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P9		(1 << 9)
/** PIOB_SCIFSR_P8 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P8		(1 << 8)
/** PIOB_SCIFSR_P7 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P7		(1 << 7)
/** PIOB_SCIFSR_P6 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P6		(1 << 6)
/** PIOB_SCIFSR_P5 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P5		(1 << 5)
/** PIOB_SCIFSR_P4 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P4		(1 << 4)
/** PIOB_SCIFSR_P3 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P3		(1 << 3)
/** PIOB_SCIFSR_P2 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P2		(1 << 2)
/** PIOB_SCIFSR_P1 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P1		(1 << 1)
/** PIOB_SCIFSR_P0 System Clock Glitch Filtering Select. **/
#define PIOB_SCIFSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_difsr DIFSR Debouncing Input Filter Select Register
@{*/

/** PIOB_DIFSR_P31 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P31		(1 << 31)
/** PIOB_DIFSR_P30 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P30		(1 << 30)
/** PIOB_DIFSR_P29 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P29		(1 << 29)
/** PIOB_DIFSR_P28 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P28		(1 << 28)
/** PIOB_DIFSR_P27 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P27		(1 << 27)
/** PIOB_DIFSR_P26 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P26		(1 << 26)
/** PIOB_DIFSR_P25 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P25		(1 << 25)
/** PIOB_DIFSR_P24 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P24		(1 << 24)
/** PIOB_DIFSR_P23 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P23		(1 << 23)
/** PIOB_DIFSR_P22 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P22		(1 << 22)
/** PIOB_DIFSR_P21 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P21		(1 << 21)
/** PIOB_DIFSR_P20 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P20		(1 << 20)
/** PIOB_DIFSR_P19 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P19		(1 << 19)
/** PIOB_DIFSR_P18 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P18		(1 << 18)
/** PIOB_DIFSR_P17 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P17		(1 << 17)
/** PIOB_DIFSR_P16 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P16		(1 << 16)
/** PIOB_DIFSR_P15 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P15		(1 << 15)
/** PIOB_DIFSR_P14 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P14		(1 << 14)
/** PIOB_DIFSR_P13 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P13		(1 << 13)
/** PIOB_DIFSR_P12 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P12		(1 << 12)
/** PIOB_DIFSR_P11 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P11		(1 << 11)
/** PIOB_DIFSR_P10 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P10		(1 << 10)
/** PIOB_DIFSR_P9 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P9		(1 << 9)
/** PIOB_DIFSR_P8 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P8		(1 << 8)
/** PIOB_DIFSR_P7 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P7		(1 << 7)
/** PIOB_DIFSR_P6 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P6		(1 << 6)
/** PIOB_DIFSR_P5 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P5		(1 << 5)
/** PIOB_DIFSR_P4 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P4		(1 << 4)
/** PIOB_DIFSR_P3 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P3		(1 << 3)
/** PIOB_DIFSR_P2 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P2		(1 << 2)
/** PIOB_DIFSR_P1 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P1		(1 << 1)
/** PIOB_DIFSR_P0 Debouncing Filtering Select. **/
#define PIOB_DIFSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_ifdgsr IFDGSR Glitch or Debouncing Input Filter Clock Selection Status Register
@{*/

/** PIOB_IFDGSR_P31 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P31		(1 << 31)
/** PIOB_IFDGSR_P30 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P30		(1 << 30)
/** PIOB_IFDGSR_P29 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P29		(1 << 29)
/** PIOB_IFDGSR_P28 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P28		(1 << 28)
/** PIOB_IFDGSR_P27 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P27		(1 << 27)
/** PIOB_IFDGSR_P26 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P26		(1 << 26)
/** PIOB_IFDGSR_P25 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P25		(1 << 25)
/** PIOB_IFDGSR_P24 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P24		(1 << 24)
/** PIOB_IFDGSR_P23 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P23		(1 << 23)
/** PIOB_IFDGSR_P22 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P22		(1 << 22)
/** PIOB_IFDGSR_P21 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P21		(1 << 21)
/** PIOB_IFDGSR_P20 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P20		(1 << 20)
/** PIOB_IFDGSR_P19 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P19		(1 << 19)
/** PIOB_IFDGSR_P18 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P18		(1 << 18)
/** PIOB_IFDGSR_P17 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P17		(1 << 17)
/** PIOB_IFDGSR_P16 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P16		(1 << 16)
/** PIOB_IFDGSR_P15 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P15		(1 << 15)
/** PIOB_IFDGSR_P14 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P14		(1 << 14)
/** PIOB_IFDGSR_P13 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P13		(1 << 13)
/** PIOB_IFDGSR_P12 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P12		(1 << 12)
/** PIOB_IFDGSR_P11 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P11		(1 << 11)
/** PIOB_IFDGSR_P10 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P10		(1 << 10)
/** PIOB_IFDGSR_P9 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P9		(1 << 9)
/** PIOB_IFDGSR_P8 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P8		(1 << 8)
/** PIOB_IFDGSR_P7 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P7		(1 << 7)
/** PIOB_IFDGSR_P6 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P6		(1 << 6)
/** PIOB_IFDGSR_P5 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P5		(1 << 5)
/** PIOB_IFDGSR_P4 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P4		(1 << 4)
/** PIOB_IFDGSR_P3 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P3		(1 << 3)
/** PIOB_IFDGSR_P2 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P2		(1 << 2)
/** PIOB_IFDGSR_P1 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P1		(1 << 1)
/** PIOB_IFDGSR_P0 Glitch or Debouncing Filter Selection Status **/
#define PIOB_IFDGSR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_scdr SCDR Slow Clock Divider Debouncing Register
@{*/


#define PIOB_SCDR_DIV_SHIFT		0
#define PIOB_SCDR_DIV_MASK		0x3fff
/** @defgroup piob_scdr_div DIV Slow Clock Divider Selection for Debouncing
@{*/
/**@}*/


/**@}*/

