grevaillot/svd_tools/headers/ATSAM3X8H/piob.h
/** PIOB_AIMER_P31 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P31		(1 << 31)
/** PIOB_AIMER_P30 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P30		(1 << 30)
/** PIOB_AIMER_P29 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P29		(1 << 29)
/** PIOB_AIMER_P28 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P28		(1 << 28)
/** PIOB_AIMER_P27 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P27		(1 << 27)
/** PIOB_AIMER_P26 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P26		(1 << 26)
/** PIOB_AIMER_P25 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P25		(1 << 25)
/** PIOB_AIMER_P24 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P24		(1 << 24)
/** PIOB_AIMER_P23 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P23		(1 << 23)
/** PIOB_AIMER_P22 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P22		(1 << 22)
/** PIOB_AIMER_P21 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P21		(1 << 21)
/** PIOB_AIMER_P20 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P20		(1 << 20)
/** PIOB_AIMER_P19 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P19		(1 << 19)
/** PIOB_AIMER_P18 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P18		(1 << 18)
/** PIOB_AIMER_P17 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P17		(1 << 17)
/** PIOB_AIMER_P16 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P16		(1 << 16)
/** PIOB_AIMER_P15 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P15		(1 << 15)
/** PIOB_AIMER_P14 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P14		(1 << 14)
/** PIOB_AIMER_P13 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P13		(1 << 13)
/** PIOB_AIMER_P12 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P12		(1 << 12)
/** PIOB_AIMER_P11 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P11		(1 << 11)
/** PIOB_AIMER_P10 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P10		(1 << 10)
/** PIOB_AIMER_P9 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P9		(1 << 9)
/** PIOB_AIMER_P8 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P8		(1 << 8)
/** PIOB_AIMER_P7 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P7		(1 << 7)
/** PIOB_AIMER_P6 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P6		(1 << 6)
/** PIOB_AIMER_P5 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P5		(1 << 5)
/** PIOB_AIMER_P4 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P4		(1 << 4)
/** PIOB_AIMER_P3 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P3		(1 << 3)
/** PIOB_AIMER_P2 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P2		(1 << 2)
/** PIOB_AIMER_P1 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P1		(1 << 1)
/** PIOB_AIMER_P0 Additional Interrupt Modes Enable. **/
#define PIOB_AIMER_P0		(1 << 0)

/**@}*/

/** @defgroup piob_aimdr AIMDR Additional Interrupt Modes Disables Register
@{*/

/** PIOB_AIMDR_P31 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P31		(1 << 31)
/** PIOB_AIMDR_P30 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P30		(1 << 30)
/** PIOB_AIMDR_P29 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P29		(1 << 29)
/** PIOB_AIMDR_P28 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P28		(1 << 28)
/** PIOB_AIMDR_P27 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P27		(1 << 27)
/** PIOB_AIMDR_P26 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P26		(1 << 26)
/** PIOB_AIMDR_P25 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P25		(1 << 25)
/** PIOB_AIMDR_P24 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P24		(1 << 24)
/** PIOB_AIMDR_P23 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P23		(1 << 23)
/** PIOB_AIMDR_P22 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P22		(1 << 22)
/** PIOB_AIMDR_P21 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P21		(1 << 21)
/** PIOB_AIMDR_P20 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P20		(1 << 20)
/** PIOB_AIMDR_P19 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P19		(1 << 19)
/** PIOB_AIMDR_P18 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P18		(1 << 18)
/** PIOB_AIMDR_P17 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P17		(1 << 17)
/** PIOB_AIMDR_P16 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P16		(1 << 16)
/** PIOB_AIMDR_P15 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P15		(1 << 15)
/** PIOB_AIMDR_P14 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P14		(1 << 14)
/** PIOB_AIMDR_P13 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P13		(1 << 13)
/** PIOB_AIMDR_P12 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P12		(1 << 12)
/** PIOB_AIMDR_P11 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P11		(1 << 11)
/** PIOB_AIMDR_P10 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P10		(1 << 10)
/** PIOB_AIMDR_P9 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P9		(1 << 9)
/** PIOB_AIMDR_P8 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P8		(1 << 8)
/** PIOB_AIMDR_P7 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P7		(1 << 7)
/** PIOB_AIMDR_P6 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P6		(1 << 6)
/** PIOB_AIMDR_P5 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P5		(1 << 5)
/** PIOB_AIMDR_P4 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P4		(1 << 4)
/** PIOB_AIMDR_P3 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P3		(1 << 3)
/** PIOB_AIMDR_P2 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P2		(1 << 2)
/** PIOB_AIMDR_P1 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P1		(1 << 1)
/** PIOB_AIMDR_P0 Additional Interrupt Modes Disable. **/
#define PIOB_AIMDR_P0		(1 << 0)

/**@}*/

/** @defgroup piob_aimmr AIMMR Additional Interrupt Modes Mask Register
@{*/

